tgv2dTests/tgv2d_temporal_OLD/pimple/pimple_nu0.0000001/TGV_temporal/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   #codeStream

{
        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};

        codeLibs
        #{
            -lmeshTools \
            -lfiniteVolume
        #};

        code
        #{

		const IOdictionary& d = static_cast<const IOdictionary&>(dict);
		const fvMesh& mesh = refCast<const fvMesh>(d.db());

		scalarField init_p(mesh.nCells(), 0.0);
	    
		forAll(init_p, i)
		{
			const scalar x = mesh.C()[i][0];
			const scalar y = mesh.C()[i][1];

		init_p[i] = -0.25*(Foam::cos(2.*x) + Foam::cos(2.*y));
		}

		init_p.writeEntry("", os);
	#};
};

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
}

// ************************************************************************* //
