tgv2dTests/tgv2d_temporal_OLD/pimple/pimple_nu0.0000001/TGV_temporal/0/error_pres_all
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       scalarField;
    location    "0";
    object      error_pres_all;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


16384
(
3.78419517943e-13
3.39117622872e-13
3.59989815735e-13
1.43718370538e-13
4.61186644429e-13
2.74058553629e-13
6.72795152923e-14
4.87609952415e-13
4.37483382854e-13
6.48370246381e-14
8.16013923099e-14
3.01203506581e-13
2.74946732048e-13
3.89133170131e-13
2.59348098552e-13
4.11337630624e-14
1.60982338571e-15
4.32459623667e-13
8.07687250415e-15
3.25295346215e-14
3.86718435053e-13
9.02056207508e-15
3.19591575426e-13
2.37171393636e-14
1.00058850094e-14
3.08225667212e-14
4.0224767961e-14
3.65332764041e-15
3.83564707773e-14
1.56211849012e-15
1.82145964978e-15
3.17119559544e-24
1.2536956159e-24
4.09091163722e-15
6.13224748758e-16
1.30659372211e-14
4.54497550706e-16
2.17603712827e-14
2.41820452551e-14
4.08562073062e-14
4.26186863578e-14
2.58210119952e-13
4.99711383384e-13
1.98480121227e-13
5.40678612992e-14
2.44165798691e-13
4.25798285519e-13
4.08617584213e-13
4.45976588992e-13
4.20441459426e-13
5.05706587717e-14
1.58872914824e-13
5.92303983638e-14
3.5799141429e-13
2.71616062975e-13
4.64628335806e-13
4.36262137526e-13
2.79665179903e-13
3.20965476419e-13
2.27318164292e-13
3.20687920663e-13
2.51354492775e-13
1.75914838252e-13
4.29600799379e-13
1.64424029947e-13
3.51274564991e-13
4.3326453536e-13
4.2876813211e-13
3.81028542051e-13
4.83890705283e-13
2.30038210702e-13
2.62290189568e-13
2.44249065418e-15
3.94018151439e-13
3.76587649953e-13
1.13242748512e-13
2.9665159218e-13
1.52933221642e-13
4.01290112251e-13
3.65540930858e-13
4.02899935636e-13
2.47774023521e-13
3.46778161742e-13
4.01262356675e-13
2.63955524105e-14
4.82086592868e-13
3.80598330629e-13
1.00058850094e-14
3.92325061327e-14
1.44467771079e-14
4.1230907577e-14
7.89646126265e-15
3.62418428601e-14
2.67754568517e-15
4.4842601854e-16
7.04395990377e-25
3.72069716935e-24
3.61169427698e-15
...
)


// ************************************************************************* //
