tgv2dTests/tgv2d_temporal_OLD/pimple/pimple_nu0.0000001/TGV_temporal/0/error_velocity_mag_all
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       scalarField;
    location    "0";
    object      error_velocity_mag_all;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


16384
(
1.46852710276e-14
4.51498235674e-14
8.86925706275e-14
1.26843012496e-13
1.84061595699e-13
2.4029137001e-13
8.46187582975e-14
5.66352915755e-14
4.08329398554e-13
1.21756381273e-13
4.95755659104e-13
4.43541408921e-13
4.85675783161e-13
2.677811219e-14
1.31100934736e-13
2.96749099248e-14
1.71501461727e-13
1.13037089721e-13
1.63406321943e-13
2.38783039956e-14
1.93834897401e-13
3.89732614747e-13
2.37066019431e-13
2.01117934244e-13
2.65248177102e-13
1.87539112686e-13
4.78174600755e-13
3.77368519042e-13
2.50133443429e-13
2.7156183372e-13
3.414013556e-13
4.68958213663e-13
2.65898424891e-13
2.62234679209e-13
2.83353875566e-13
9.64902931658e-14
4.54430235222e-14
4.63636432167e-13
3.45612755605e-13
4.14150485386e-14
4.21774202321e-13
4.0704293491e-13
3.66308415104e-13
4.83069991504e-13
4.63934678486e-13
3.98991382599e-13
1.95543049919e-13
3.84122227694e-13
2.20346083793e-13
1.95930794054e-13
2.03914785291e-13
3.20715508265e-13
3.59412602563e-14
5.08745014112e-14
4.05603833924e-13
2.87493185489e-13
3.68705280527e-13
3.68348138312e-13
2.05017263483e-13
4.0899109906e-14
1.27346898944e-13
2.5340770806e-13
1.31190726594e-14
4.12925947565e-14
4.39717614986e-14
3.86966406254e-14
4.34960644831e-13
2.3429842608e-13
1.5847133097e-13
2.35838723025e-13
1.63809532767e-13
1.37363361803e-13
4.16644206907e-13
5.77285852049e-14
1.71667823764e-13
2.95477919839e-13
1.07399003363e-13
2.63017071077e-13
2.53657327938e-13
3.76381939091e-13
4.9715806877e-14
4.58557435277e-13
1.47330019113e-13
1.6892736183e-13
4.34007712743e-13
1.50935384279e-13
1.25321884274e-13
1.75970441885e-13
4.28325495277e-13
2.93482251051e-14
4.20026826338e-13
2.90438656894e-13
4.03011975251e-13
2.5991185131e-13
5.52617425857e-14
3.28181952561e-13
6.30606845544e-14
1.34024540486e-13
...
)


// ************************************************************************* //
